#include "timer.h"
#include "usart1.h"
#include "stdio.h"

/**************************************************
TIM5_CH2  PA1实现PWM输出功能
参数： psc是预分频值（1~65536）
	   arr是重装载值（0~65535）
注意：PWM模式选择模式1：在递增计数模式下，只要 TIMx_CNT<TIMx_CCR1，通道 1 便为有效状态，否则为无效状态。
			输出极性选择有效电平为低电平
			则，低电平的占空比为  ccr1/arr ;
			低电平的占空比越大，LED1越亮。
**************************************************/
/*******************************************************************************************************
**** 程序名称：   TIM5_CH2_Init
**** 设计者:      Zhangxx    日期：2018年11月09日
**** 修改者:      Zhangxx    日期：2018年11月09日
**** 功  能：	    PWM驱动
**** 版本信息:    V0.1
**** 说  明：     
****编程思路：    
****信盈达官网：  www.edu118.com   成才热线：18948782707
********************************************************************************************************/
void TIM5_CH2_Init(u16 psc,u16 arr,u16 ccr2)
{
		/******GPIO复用**********/	 
		RCC->AHB1ENR  |=1<<0;         //GPIOA时钟源选择
		GPIOA->MODER  &=~(0x3<<(1*2));  //GPIOA1模式配置
		GPIOA->MODER  |=2<<(1*2);     //复用模式
		GPIOA->AFR[0] &=~(0xF<<(1*4));//GPIO复用功能选择
		GPIOA->AFR[0] |=0x2<<(1*4);     //复用功能选择AF2(TIM5_CH2)
		/*****时基单元配置*******/	  
		RCC->APB1ENR |=1<<3;  //使能TIM5时钟源        
 
		TIM5->CR1 |=1<<7;     //自动重载预装载使能      
		TIM5->CR1 &=~(1<<3);  //计数模式（循环计数）
		TIM5->CR1 &=~(1<<2);  //选择更新请求源          
		TIM5->CR1 &=~(1<<1);  //使能更新  
	
   	TIM5->PSC  = psc-1;    //配置预分频器  
		TIM5->ARR  = arr;      //配置自动重装载寄存器    
		TIM5->EGR |=1<<0;     //手动更新，初始化计数器  
		TIM5->SR  &=~(1<<0);  //清除更新标志位 
       
				/***** CH2 PWM输出模式配置*******/	 
		TIM5->CCMR1 &=~(3<<8);  //定义通道方向为输出
		TIM5->CCMR1 &=~(7<<12); //输出比较模式
		TIM5->CCMR1 |=6<<12;    //选择PWM模式2
		TIM5->CCMR1 |=1<<11;    //输出比较2预装载使能
		TIM5->CCER  |=1<<5;     //输出比较的极性选择有效电平为低电平
		TIM5->CCER  |=1<<7;     //捕获/比较寄存器预装载使能
		
		TIM5->CCR2 = ccr2;     //写入输出比较值	
		TIM5->CCER  |=1<<4;     //通道2输出使能
 		TIM5->CR1 |=1<<0;       //计数器使能 
}






