#include "stm32f10x.h"                  // Device header
#include "spi.h"
/****************************************************************************************
函数功能：SPI2初始化函数
硬件接口：
	SPI2_SCLK -------- PB13,SPI时钟引脚----复用推挽输出
	SPI2_MOSI -------- PB15,SPI输出引脚----复用推挽输出
	SPI2_MISO -------- PB14,SPI输入引脚----浮空输入
****************************************************************************************/
void SPI_2_Init(void)
{
	RCC->APB2ENR |=1<<3;  //使能B时钟
 	RCC->APB2ENR |=1<<0;  //使能辅助时钟
	AFIO->MAPR &=~(7<<24);
	AFIO->MAPR |=0X2<<24;	  
 
	RCC->APB1ENR |=1<<14;  //SPI2时钟使能
	 

	  /*SCK----PB13*/ //推挽输出 50MHZ
  GPIOB->CRH &=~(0xF<<5*4);
	GPIOB->CRH |=(0xB<<5*4);
	
		/*MISO---PB14*/ //
  GPIOB->CRH&=~(0XF<<((14-8)*4));
	GPIOB->CRH |=0X8<<((14-8)*4);
	
		/*MOSI---PB15*/ //推挽输出 50MHZ
  GPIOB->CRH &=~(0XF<<((15-8)*4));
	GPIOB->CRH |=0XB<<((15-8)*4);

	SPI2->CR1 &=~(1<<11); //8位数据帧
	SPI2->CR1 |=1<<9;  //
	SPI2->CR1 |=1<<8;  //
	SPI2->CR1 &=~(1<<7);  //先发高位
	SPI2->CR1 &=~(7<<3);  
	SPI2->CR1 |=0<<3;  //波特率
	SPI2->CR1 |=1<<1;  //时钟空闲状态为高电平
	SPI2->CR1 |=1<<0;  //在时钟第二个电平发送数据
	SPI2->CR1 |=1<<2; //主SPI
	
	SPI2->CR1 |=1<<6;     //使能SPI

}


/**************************************************************************
函数功能：SPI2的读写函数
函数参数：
	Data：发送的数据
函数返回值：接收的数据
**************************************************************************/
u8 SPI_Read_Write_Byte(u8 Data)
{
	//检测发送缓冲区是否为空
	while(!(SPI2->SR & 1 << 1));
	//将要发送的数据赋值给数据寄存器
	SPI2->DR = Data;
	//检测接收缓冲区是否为非空
	while(!(SPI2->SR & 1 << 0));
	//将数据寄存器赋值给一个变量
	Data = SPI2->DR;
	
	return Data;
}

 





 