#include "stm32f10x.h"                  // Device header
#include "motor.h"
#include "systick.h"


/**************************** 电机初始化函数 ****************************
功  能：实现电机引脚的初始化
参  数：无
返回值：无
***********************************************************************/
void lock_init(void)
{
  RCC->APB2ENR |=1<<2;  //使能A时钟
	
	GPIOA->CRL &=~(15 <<(4*4)); //M+  推挽输出 50MHz
	GPIOA->CRL |=3<<(4*4);
	
	GPIOA->CRL &=~(15 <<(5*4)); //M-   推挽输出 50MHz
	GPIOA->CRL |=3<<(5*4);
	GPIOA->ODR &=~(1<<5);
	GPIOA->ODR &=~(1<<5);
	
  set_lock_sta(1,0);   //先锁住把手
}


/*******************************************************************
* 函数名： set_lock_sta     
* 功能描述 ：    设置锁的状态
* 参数说明：  u8 mplus   u8 msub  
* 返回值说明：   无
* 函数描述：
            参数传0 1  开启电机  传1 0关闭电机
*******************************************************************/
void set_lock_sta(u8 mplus,u8 msub)
{
 if(mplus) GPIOA->ODR |=1<<4;
	else GPIOA->ODR &=~(1<<4);
 if(msub) GPIOA->ODR |=1<<5;
	else  GPIOA->ODR &=~(1<<5);
	Delay_ms(250); 			 //更改锁状态，给电平时间不能太久（内部弹簧只有几圈），150-200ms就可以
		
	GPIOA->ODR &=~(1<< 4);
	GPIOA->ODR &=~(1<< 5);
}

/*******************************************************************
* 函数名：     
* 功能描述 ：    解锁
* 参数说明：     无
* 返回值说明：   无
* 修改记录：
* 其他：
*******************************************************************/
void open_lock(u8 s)
{
  set_lock_sta(0,1); //解锁门
	Delay_ms(s*1000);
	set_lock_sta(1,0); //一段时间后，锁住门
}





















